#include<iostream>
using namespace std;
int main(){
 int n=0,k=0,i,j;//объ€вление и инициализаци€ массива 150x150  и переменных
 while((n<1)||(n>150)||(k<1)||(k>150)){//защита от некорректного ввода значений
  cout<<"N (1-150)= ";
  cin>>n;//ввод N
  cout<<"K (1-150)= ";
  cin>>k;// ввод K
 }
 int p[n+1][k+1];
 for(i=1;i<n+1;i++) //вычисление количества разбиений числа
  for(j=1;j<k+1;j++){
   if((j==1)||(i==j))p[i][j]=1;//при k=1 или n=k кол-во разбиений равно 1
   if (i < j) p[i][j] = 0; //при n<k кол-во разбиений равно 1
   if ((i > j) && (j != 1))p[i][j]=p[i-1][j-1]+p[i-j][j];//при n>k и k не 1 P=P(n-1,k-1)+P(n-k,k) значени€ дл€ вычислений берем из массива
  }
 cout<<"P="<<p[n][k]<<endl;//вывод результата
 getchar();
 return 0;
}
